In [1]:
# Set and read the file. Show first 5 rows.
import pandas as pd
file = ("resources/ufoSightings.csv")
df = pd.read_csv(file)
df.head()

,datetime,city,state,country,shape,duration (seconds),duration (hours/min),comments,date posted,latitude,longitude
0,10/10/1949 20:30,san marcos,tx,us,cylinder,2700,45 minutes,This event took place in early fall around 194...,4/27/2004,29.8830556,-97.941111
1,10/10/1949 21:00,lackland afb,tx,NaN,light,7200,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.38421,-98.581082
2,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.2,-2.916667
3,10/10/1956 21:00,edna,tx,us,circle,20,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.9783333,-96.645833
4,10/10/1960 20:00,kaneohe,hi,us,light,900,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.4180556,-157.803611

In [2]:
# Remove unwanted columns and show updated header
del df["comments"]
del df["shape"]
del df["city"]
del df["duration (hours/min)"]
del df["latitude"]
del df["longitude "]
del df["date posted"]

df.head()

           datetime state country duration (seconds)
0  10/10/1949 20:30    tx      us               2700
1  10/10/1949 21:00    tx     NaN               7200
2  10/10/1955 17:00   NaN      gb                 20
3  10/10/1956 21:00    tx      us                 20
4  10/10/1960 20:00    hi      us                900

In [3]:
# Show the types for each column
df.dtypes

datetime              object
state                 object
country               object
duration (seconds)    object
dtype: object

In [4]:
# The next code block could not change type to_numeric. There were some values that had ` in them. had to remove. 
# This will not work for fututre csv files. need to find way to detect and delete or correct these values.
df.loc[27822,["duration (seconds)"]] = 2
df.loc[35692,["duration (seconds)"]] = 8
df.loc[58591,["duration (seconds)"]] = .5

In [5]:
# Re-assign types required
df["duration (seconds)"] = pd.to_numeric(df["duration (seconds)"])

In [6]:
# Confirm the type has been re-assigned 
df.dtypes

datetime               object
state                  object
country                object
duration (seconds)    float64
dtype: object

In [7]:
# Show count of non-null values in each column
df.count()

datetime              80332
state                 74535
country               70662
duration (seconds)    80332
dtype: int64

In [8]:
# Delete all rows with a null value in any column 
df = df.dropna(how="any")

# Confirm the rows are the same quantity. This will confirm that all null values are gone.
df.count()

datetime              68121
state                 68121
country               68121
duration (seconds)    68121
dtype: int64

In [15]:
df2 = df.groupby(["country", "state"])

In [17]:
df2.count().head()

               datetime  duration (seconds)
country state
au      al            1                   1
        dc            1                   1
        nt            2                   2
        oh            1                   1
        sa            2                   2

In [ ]:
# review all the above and add more comments
# continue to break this data down with pandas 
# bonus: get a report to a txt file with a graph!!